tap "hashicorp/tap"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "xcodesorg/made"
brew "zstd"
brew "aider"
brew "cryptography"
brew "python@3.13"
brew "awscli"
brew "docker-compose"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "jsonnet"
brew "zlib"
brew "mysql", restart_service: :changed
brew "mysql-client"
brew "nlopt"
brew "nodenv"
brew "openssl@1.1"
brew "php"
brew "pyenv"
brew "python@3.11"
brew "r"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rustup"
brew "spotifyd"
brew "tenv"
brew "tree"
brew "typescript"
brew "vim"
brew "yarn"
brew "hashicorp/tap/terraform", link: false
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "maccy"
cask "ngrok"
cask "notion"
cask "slack"
cask "spotify"
cask "unity-hub"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
vscode "aki77.html-erb"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "ftsamoyed.theme-pink-cat-boo"
vscode "hashicorp.terraform"
vscode "matheusq94.tfs"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "nemesv.copy-file-name"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "solomonkinard.git-blame"
vscode "streetsidesoftware.code-spell-checker"
vscode "wscats.html-snippets"
